Toutes les commandes utiles pour configurer les routeurs

Lien utile : https://www.cisco.com/c/en/us/td/docs/ios/mpls/configuration/guide/convert/mp_ldp_book/mp_ldp_overview.html

Configure adresse IPv4 pour chaque interface
R #config terminal
> R(config) #interface GigabitEthernet1/0
  > R(config-if) #ip address 192.168.1.1 255.255.255.0
  > R(config-if) #no shutdown
  > R(config-if) #exit



Conf OSPFv2
R3(config)#router ospf 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#exit
R3(config)#interface g1/0
R3(config-if)#ip ospf 1 area 0                        (ospf 1 = "nom" de l'ospf, il peut y en avoir plusieurs par interfaces donc utile pour les différencier. Area 0 = ici on taffe dans le backbone)
R3(config-if)#no sh
R3(config-if)#exit
Vérif en pingant d'un bout à l'autre

Sauvegarder la configuration du routeur
R#write 

Conf Loopback0 sur routeur X
R #config terminal
> R(config) #interface Loopback0
  > R(config-if) #ip address X.X.X.X
  > R(config-if) #ip ospf 1 area 0 (on met ospf sur l'interface, on peut ping)
  > R(configif) #no shutdown
  > R(config-if) #exit


Conf LDP :
R #config terminal
> R(config) #mpls ip
> R(config) #mpls label protocol ldp
(puis pour chaque interface :)
> R(config) #interface g1/0
  > R(config-if) #mpls ip
  > R(config-if) #exit

Configurer LDP :
R>enable
R#conf ter
Router(config)# mpls ip
Router(config)# mpls label protocol ldp
Router(config)# interface g1/0
Router(config-if)# mpls ip

Raccourcis :
- config terminal : conf ter
- GigabitEthernet1/0 : g1/0
- interface : int
- no shutdown : no sh



Loopback :
Sert au routeur à s'envoyer des trucs, pour vérif s'il marche
Sert aussi à atteindre un routeur quelque soient l'état de ses interfaces (déso BGP), s'il est encore dans le réseau. DOnc on dit à la session BGP qu'il faut parler à la Loopback avec notre Loopback, et gngngn
