Toutes les commandes utiles pour configurer les routeurs

Lien utile : https://www.cisco.com/c/en/us/td/docs/ios/mpls/configuration/guide/convert/mp_ldp_book/mp_ldp_overview.html

Configure adresse IPv4 pour chaque interface
R #config terminal
> R(config) #interface GigabitEthernet1/0
  > R(config-if) #ip address 192.168.1.1 255.255.255.0
  > R(config-if) #no shutdown
  > R(config-if) #exit



Conf OSPFv2
R3(config)#router ospf 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#exit
R3(config)#interface g1/0
R3(config-if)#ip ospf 1 area 0                        (ospf 1 = "nom" de l'ospf, il peut y en avoir plusieurs par interfaces donc utile pour les différencier. Area 0 = ici on taffe dans le backbone)
R3(config-if)#no sh
R3(config-if)#exit
Vérif en pingant d'un bout à l'autre

Sauvegarder la configuration du routeur
R#write 

Conf Loopback0 sur routeur X
R #config terminal
> R(config) #interface Loopback0
  > R(config-if) #ip address X.X.X.X
  > R(config-if) #ip ospf 1 area 0 (on met ospf sur l'interface, on peut ping)
  > R(configif) #no shutdown
  > R(config-if) #exit


Conf LDP :
R #config terminal
> R(config) #mpls ip
> R(config) #mpls label protocol ldp
(puis pour chaque interface :)
> R(config) #interface g1/0
  > R(config-if) #mpls ip
  > R(config-if) #exit

Conf BGP Loopback to Loopback : ex de PE1 à PE2 (pas sur routeurs de coeur) (AS = 1, PE1 Loopback0 = 1.1.1.1, id router PE1 = 1.1.1.1, PE2 Loopback0 = 4.4.4.4, PE2 id = 4.4.4.4 bah oui on est des zozos)
R #conf ter
Router(config)# router bgp <as-number>
Router(config-route)# bgp router-id <X.X.X.X>
Router(config-router)# neighbor <adresse looupebach> remote-as <as-number>
Router(config-router)# neighbor <adresse looupebach> update-source Loopback0

          ex sur PE1 :
              Router(config)# router bgp 1
              Router(config-route)# bgp router-id 1.1.1.1
              Routeur(config-router)# neighbor 4.4.4.4 remote-as 1
              Routeur(config-router)# neighbor 4.4.4.4 update-source Loopback0



Conf BGP
R #conf ter
Router(config)# router bgp <as-number>
Router(config-route)# bgp router-id <X.X.X.X>
Routeur(config-router)# neighbor <ipv4-address> remote-as <as-number>
Routeur(config-router)# address-family ipv4 unicast
Router(config-router-af)# neighbor <ipv4-address> activate

Conf VRF
https://netseccloud.com/setting-up-vrf-on-cisco-routers-a-step-by-step-tutorial

CONF CE-PE
PE
R #conf ter
Router(config)# router bgp <as-number>
Router(config-route)# bgp router-id <X.X.X.X>
Routeur(config-router)# address-family ipv4 vrf <nom vrf>
Router(config-router-af)# neighbor <ipv4-address> activate
Routeur(config-router-af)# neighbor <ipv4-address> remote-as <as-number>

CE
meme chose que bgp

Raccourcis :
- config terminal : conf ter
- GigabitEthernet1/0 : g1/0
- interface : int
- no shutdown : no sh


-------------------------------------------------------------------- NOTES --------------------------------------------------------------------
Loopback :
Sert au routeur à s'envoyer des trucs, pour vérif s'il marche
Sert aussi à atteindre un routeur quelque soient l'état de ses interfaces (déso BGP), s'il est encore dans le réseau. DOnc on dit à la session BGP qu'il faut parler à la Loopback avec notre Loopback, et gngngn
